"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Постарайтесь решить задачу двумя способами:
1. Через цикл
Вариант исполнения: в бесконечном цикле запрашивайте вид операции, например, +, - или *
Проверяйте вид операции и запускайте соответствующую команду
Предусмотрите выход из бесконечного цикла
2. Рекурсией.
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 45
Введите второе число: 56
Результат 45 + 56 = 101
Введите операцию (+, -, *, / или 0 для выхода): rth
Неверная операция. Повторите ввод
Введите операцию (+, -, *, / или 0 для выхода):

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ ЦИКЛ
"""
while True:
    try:
        print('Введите операцию (+, -, *, / или 0 для выхода):', end=' ')
        CMD_TYPE = input()
        if CMD_TYPE != '+' and CMD_TYPE != '-' and CMD_TYPE != '*' and CMD_TYPE != '/' and CMD_TYPE != '0':
            print('Неверная операция. Повторите ввод')
        else:
            if CMD_TYPE == '0':
                break
            print('Введите первое число:', end=' ')
            FIRST_NUM = int(input())
            print('Введите второе число:', end=' ')
            SECOND_NUM = int(input())
            print(f'Результат {FIRST_NUM} {CMD_TYPE} {SECOND_NUM} =', end=' ')
            if CMD_TYPE == '+':
                print(FIRST_NUM + SECOND_NUM)
            elif CMD_TYPE == '-':
                print(FIRST_NUM - SECOND_NUM)
            elif CMD_TYPE == '*':
                print(FIRST_NUM * SECOND_NUM)
            elif CMD_TYPE == '/':
                print(FIRST_NUM / SECOND_NUM)
    except ValueError:
        print('Ошибка ввода числа')
    except ZeroDivisionError:
        print('Ошибка деления на 0')
