"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ РЕКУРСИЮ
"""


def task3(num):
    if num <= 0:
        return 0
    else:
        abort_num = (num % 10)
        num //= 10
        return abort_num + task3(num) / 10


try:
    print('Введите число:', end=" ")
    NUMBER = int(input())
    print(f'Перевернутое число: {task3(NUMBER)}')
except ValueError:
    print('Ошибка ввода числа')