"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
Используйте арифм операции для формирования числа, обратного введенному

Пример:
Введите число: 123
Перевернутое число: 321

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ ЦИКЛ
"""
try:
    print('Введите число:', end=" ")
    NUMBER = int(input())
    NUMBER_ABORT = 0
    while NUMBER:
        NUMBER_ABORT += NUMBER % 10
        NUMBER //= 10
        if NUMBER:
            NUMBER_ABORT *= 10
    print(f'Перевернутое число: {NUMBER_ABORT}')
except ValueError:
    print('Ошибка ввода числа')
