"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ ЦИКЛ
"""
try:
    print('Введите натуральное число:')
    NUM = int(input())
    FACTORIAL = 0
    print(f'n(n + 1) / 2 = {NUM*(NUM+1) / 2}')
    while NUM:
        FACTORIAL += NUM
        NUM -= 1
    print(f'1+2+...+n = {FACTORIAL}')
except ValueError:
    print('Ошибка ввода числа')
